In [19]:
import pandas as pd
data = {'名称': ['小明', '小红', '小刚', '小李', '小张'],
        '性别': ['男', '女', '男', '男', '女'],
        '年龄': [20, 22, 21, 19, 18],
        '成绩': [80, 85, 72, 90, None]}

df = pd.DataFrame(data)

In [20]:
df

   名称 性别  年龄    成绩
0  小明  男  20  80.0
1  小红  女  22  85.0
2  小刚  男  21  72.0
3  小李  男  19  90.0
4  小张  女  18   NaN

In [21]:
mean_score = df['成绩'].mean()

In [22]:
mean_score

81.75

In [23]:
df['成绩'].fillna(mean_score, inplace=True)

In [24]:
df['成绩']

0    80.00
1    85.00
2    72.00
3    90.00
4    81.75
Name: 成绩, dtype: float64

In [25]:
import matplotlib.pyplot as plt

In [26]:
df = pd.concat([df, pd.get_dummies(df['性别'], prefix='性别')], axis=1)

In [27]:
df

   名称 性别  年龄     成绩   性别_女   性别_男
0  小明  男  20  80.00  False   True
1  小红  女  22  85.00   True  False
2  小刚  男  21  72.00  False   True
3  小李  男  19  90.00  False   True
4  小张  女  18  81.75   True  False

In [31]:
df.drop('性别', axis=1,inplace=True)

In [29]:
df

   名称 性别  年龄     成绩   性别_女   性别_男
0  小明  男  20  80.00  False   True
1  小红  女  22  85.00   True  False
2  小刚  男  21  72.00  False   True
3  小李  男  19  90.00  False   True
4  小张  女  18  81.75   True  False

In [32]:
print(df)

   名称  年龄     成绩   性别_女   性别_男
0  小明  20  80.00  False   True
1  小红  22  85.00   True  False
2  小刚  21  72.00  False   True
3  小李  19  90.00  False   True
4  小张  18  81.75   True  False